minhnhatndc/minhatndc.github.io/modified_SDcard_NRF52.c
static ble_nus_t                        m_nus;                                      /**< Structure to identify the Nordic UART Service. */
//static ble_nus_t1                       m_nus1;                                      /**< Structure to identify the Nordic UART Service. */

static uint16_t  m_conn_handle = BLE_CONN_HANDLE_INVALID; /**< Handle of the current connection. */
static ble_bas_t m_bas;                                   /**< Structure used to identify the battery service. */
static ble_hrs_t m_hrs;                                   /**< Structure used to identify the heart rate service. */
static bool      m_rr_interval_enabled = true;            /**< Flag for enabling and disabling the registration of new RR interval measurements (the purpose of disabling this is just to test sending HRM without RR interval data. */

static nrf_ble_gatt_t m_gatt;                             /**< Structure for gatt module*/

static sensorsim_cfg_t   m_battery_sim_cfg;               /**< Battery Level sensor simulator configuration. */
static sensorsim_state_t m_battery_sim_state;             /**< Battery Level sensor simulator state. */
static sensorsim_cfg_t   m_heart_rate_sim_cfg;            /**< Heart Rate sensor simulator configuration. */
static sensorsim_state_t m_heart_rate_sim_state;          /**< Heart Rate sensor simulator state. */
static sensorsim_cfg_t   m_rr_interval_sim_cfg;           /**< RR Interval sensor simulator configuration. */
static sensorsim_state_t m_rr_interval_sim_state;         /**< RR Interval sensor simulator state. */

APP_TIMER_DEF(m_battery_timer_id);                        /**< Battery timer. */
APP_TIMER_DEF(m_heart_rate_timer_id);                     /**< Heart rate measurement timer. */
APP_TIMER_DEF(m_rr_interval_timer_id);                    /**< RR interval timer. */                 /**< RR interval timer. */
APP_TIMER_DEF(m_sensor_contact_timer_id);                 /**< Sensor contact detected timer. */


static ble_uuid_t m_adv_uuids[] = {{BLE_UUID_HEART_RATE_SERVICE, BLE_UUID_TYPE_BLE},
                                   {BLE_UUID_BATTERY_SERVICE, BLE_UUID_TYPE_BLE},
                                   {BLE_UUID_DEVICE_INFORMATION_SERVICE, BLE_UUID_TYPE_BLE}}; /**< Universally unique service identifiers. */


//=======================================SD Card Start===================================================================================

#define FILE_NAME1   "ank.TXT"
#define TEST_STRING1 "Ankush HTIC.\r\n"

#define SDC_SCK_PIN     ARDUINO_13_PIN  ///< SDC serial clock (SCK) pin.
#define SDC_MOSI_PIN    ARDUINO_11_PIN  ///< SDC serial data in (DI) pin.
#define SDC_MISO_PIN    ARDUINO_12_PIN  ///< SDC serial data out (DO) pin.
#define SDC_CS_PIN      ARDUINO_10_PIN  ///< SDC chip select (CS) pin.




NRF_BLOCK_DEV_SDC_DEFINE(
        m_block_dev_sdc,
        NRF_BLOCK_DEV_SDC_CONFIG(
                SDC_SECTOR_SIZE,
                APP_SDCARD_CONFIG(SDC_MOSI_PIN, SDC_MISO_PIN, SDC_SCK_PIN, SDC_CS_PIN)
         ),
         NFR_BLOCK_DEV_INFO_CONFIG("Nordic", "SDC", "1.00")
);



static void fatfs_example()
{
    static FATFS fs;
    static FILINFO fno;
    static FIL file;
    FRESULT ff_result;
    DSTATUS disk_state = STA_NOINIT;

    // Initialize FATFS disk I/O interface by providing the block device.
    static diskio_blkdev_t drives[] =
    {
            DISKIO_BLOCKDEV_CONFIG(NRF_BLOCKDEV_BASE_ADDR(m_block_dev_sdc, block_dev), NULL)
    };

    diskio_blockdev_register(drives, ARRAY_SIZE(drives));

    printf("Initializing disk 0 (SDC)...\r\n");
    for (uint32_t retries = 3; retries && disk_state; --retries)
    {
        disk_state = disk_initialize(0);
    }
    if (disk_state)
    {
        printf("Disk initialization failed.\r\n");
        return;
    }
    
    uint32_t blocks_per_mb = (1024uL * 1024uL) / m_block_dev_sdc.block_dev.p_ops->geometry(&m_block_dev_sdc.block_dev)->blk_size;
    uint32_t capacity = m_block_dev_sdc.block_dev.p_ops->geometry(&m_block_dev_sdc.block_dev)->blk_count / blocks_per_mb;
    printf("Capacity: %d MB\r\n", capacity);

    printf("Mounting volume...\r\n");
    ff_result = f_mount(&fs, "", 1);
    if (ff_result)
    {
        printf("Mount failed.\r\n");
        return;
    }

//    printf("\r\n Listing directory: /\r\n");
//    ff_result = f_opendir(&dir, "/");
//    if (ff_result)
//    {
//        printf("Directory listing failed!\r\n");
//        return;
//    }
    
//    do
//    {
//        ff_result = f_readdir(&dir, &fno);
//        if (ff_result != FR_OK)
//        {
//            printf("Directory read failed.");
//            return;
//        }
//        
//        if (fno.fname[0])
//        {
//            if (fno.fattrib & AM_DIR)
//            {
//                //NRF_LOG_RAW_INFO("   <DIR>   %s\r\n",(uint32_t)fno.fname);
//            }
//            else
//            {
//                //NRF_LOG_RAW_INFO("%9lu  %s\r\n", fno.fsize, (uint32_t)fno.fname);
//            }
//        }
//    }
    while (fno.fname[0]);

    uint16_t size = 0;
    size = f_size(&file);
    printf("Size on Disk is  = %d bytes",size);
    
    return;
}

void SD_Write()
{
    //static FATFS fs;
    static DIR dir;
    //static FILINFO fno;
    static FIL file;
    FRESULT ff_result;
    uint32_t bytes_written;
    
    
    //printf("\r\n Listing directory: /\r\n");
    ff_result = f_opendir(&dir, "/");
    if (ff_result)
    {
        printf("Directory listing failed!\r\n");
        return;
    }
    
//    do
//    {
//        ff_result = f_readdir(&dir, &fno);
//        if (ff_result != FR_OK)
//        {
//            printf("Directory read failed.");
//            return;
//        }
//        
//        if (fno.fname[0])
//        {
//            if (fno.fattrib & AM_DIR)
//            {
//                //printf("   <DIR>   %c\r\n",(uint32_t)fno.fname);
//            }
//            else
//            {
//                //printf("%9lu  %c\r\n", fno.fsize, (uint32_t)fno.fname);
//            }
//        }
//    }
//    while (fno.fname[0]);
    
    
    uint8_t d[10] = {255,255,255,255,255,255,255,255,255,255};
    char buffer [50]={0};
    int n;
    uint16_t size = 0;
    size = f_size(&file);
    printf("Size on Disk is  = %d bytes",size);
    
    ff_result = f_open(&file, FILE_NAME1, FA_READ | FA_WRITE | FA_OPEN_APPEND);
    if (ff_result != FR_OK)
    {
        printf("Unable to open or create file: " FILE_NAME1 ".\r\n");
        return;
    }
    
    n=sprintf (buffer,"%d %d %d %d %d %d %d %d %d %d\r",d[0],d[1],d[2],d[3],d[4],d[5],d[6],d[7],d[8],d[9]);

    for(uint8_t i=0;i<1;i++)
    {
        ff_result = f_write(&file, buffer, n, (UINT *) &bytes_written);
        if (ff_result != FR_OK)
        {
            printf("Write failed\r\n.");
        }
        else
        {
            printf("%d bytes written.\r\n", bytes_written);
        }
    }
    (void) f_close(&file);
    
        //remove perticular file 
//    ff_result = f_unlink ("ANK.TXT");
//    if (ff_result != FR_OK)
//    {
//        printf("Write failed\r\n.");
//    }
//    else
//    {
//        printf("file removed = ANK.TXT \r\n");
//    }
  
