minhnhatndc/minhatndc.github.io/modified_SDcard_NRF52.c
}


//=======================================SD Card END=====================================================================================


//================================== - LEAD OFF END configuration===========================
#ifdef Lo_neg
    #define RA_disconnect Lo_neg
#endif
#ifndef RA_disconnect
    #error "Please indicate input pin"
#endif

static void gpio_init(void)
{
    nrf_gpio_cfg_input(RA_disconnect, NRF_GPIO_PIN_PULLDOWN);
}

//=================================================GPIO - LEAD OFF END===============================================
//===========================================SAADC Start==================================
#define SAMPLES_IN_BUFFER 24
#define SAADC_BURST_MODE 1                        //Set to 1 to enable BURST mode, otherwise set to 0.

static const nrf_drv_timer_t   m_timer = NRF_DRV_TIMER_INSTANCE(2);
static nrf_saadc_value_t       m_buffer_pool[2][SAMPLES_IN_BUFFER];
static nrf_ppi_channel_t       m_ppi_channel;

//static uint32_t              m_adc_evt_counter;

int16_t ADC_values[12] = {0},ADC_values1[12] = {0},Battery_values[12] = {0},Battery_values1[12] = {0};
nrf_saadc_value_t *data_buffer, *data_buffer1;

float ecg[24]={0},ecg_temp[12]={0};
uint8_t count=0;
static uint8_t  battery_level;
uint16_t frequency = 2000;
//static uint16_t tempconst = 0;
static uint32_t    seq_num=0;
//static bool RA_LDO = false;
bool mode_2_flag = false,mode2_running = false,mode1_running = false,HR_ready = false;
bool SD_flag = false;

extern uint8_t RRate;
extern uint8_t HR;
extern uint16_t RPeak[10];
extern uint8_t beat;
//extern uint16_t fs;
extern bool signal_noisy;
extern bool hr_data_ready;


uint8_t exception_flag = 0x00;
uint16_t sx = 1;
uint8_t buff[20]={0};
uint32_t pin=0;
uint8_t RA_LDO_cnt = 0;


void timer_handler(nrf_timer_event_t event_type, void* p_context)
{

}


void saadc_sampling_event_enable(void)
{
    ret_code_t err_code = nrf_drv_ppi_channel_enable(m_ppi_channel);
    APP_ERROR_CHECK(err_code);
}


void saadc_sampling_event_disable(void)
{
    ret_code_t err_code = nrf_drv_ppi_channel_disable(m_ppi_channel);
    APP_ERROR_CHECK(err_code);
}


void saadc_sampling_event_uninit(void)
{
    ret_code_t err_code;
    
    saadc_sampling_event_disable();
    err_code = nrf_drv_ppi_channel_free(m_ppi_channel);
    APP_ERROR_CHECK(err_code);

    nrf_drv_timer_disable(&m_timer);

    nrf_drv_timer_uninit(&m_timer);

    nrf_drv_ppi_uninit();
}

void saadc_sampling_event_init(void)
{
    ret_code_t err_code;
    err_code = nrf_drv_ppi_init();
    APP_ERROR_CHECK(err_code);

    err_code = nrf_drv_timer_init(&m_timer, NULL, timer_handler);
    APP_ERROR_CHECK(err_code);

    /* setup m_timer for compare event every 400ms */
    uint32_t ticks = nrf_drv_timer_us_to_ticks(&m_timer, frequency);
    nrf_drv_timer_extended_compare(&m_timer, NRF_TIMER_CC_CHANNEL0, ticks, NRF_TIMER_SHORT_COMPARE0_CLEAR_MASK, false);
    nrf_drv_timer_enable(&m_timer);

    uint32_t timer_compare_event_addr = nrf_drv_timer_compare_event_address_get(&m_timer, NRF_TIMER_CC_CHANNEL0);
    uint32_t saadc_sample_event_addr = nrf_drv_saadc_sample_task_get();

    /* setup ppi channel so that timer compare event is triggering sample task in SAADC */
    err_code = nrf_drv_ppi_channel_alloc(&m_ppi_channel);
    APP_ERROR_CHECK(err_code);
    
    err_code = nrf_drv_ppi_channel_assign(m_ppi_channel, timer_compare_event_addr, saadc_sample_event_addr);
    APP_ERROR_CHECK(err_code);
}

void send_to_app(uint8_t *buff)
{

    //uint32_t    err_code;
    if(seq_num<=84)
    {
        buff[0] = seq_num;
        seq_num++;
    }
    else
    {			
        seq_num = 0;
        buff[0] = seq_num;
        seq_num++;
    }
    
    pin = nrf_gpio_pin_read(RA_disconnect);
    if(pin == 1)
    {
        buff[19] = 0x10;
        pin = 0;
    }

    SD_flag = true;
    //SD_Write();
//    err_code = ble_nus_string_send(&m_nus, buff, 20);
//    if (err_code != NRF_ERROR_INVALID_STATE)
//    {
//			APP_ERROR_CHECK(err_code);
//    }
//    else
    {}
    memset(buff,0,sizeof(buff));
}


void mode2_function(nrf_drv_saadc_evt_t const * p_event)
{
    uint16_t i;
    int16_t sum = 0;
    uint32_t test = 0x0FFFFFF0,temp=0;
    //memset(&buff[0],0,sizeof(buff));
    data_buffer1 = p_event->data.done.p_buffer;
	
   	for (i=0;i<12;i++)
    {
        ADC_values1[i] =*(data_buffer1+i*2);
        Battery_values1[i] = *(data_buffer1+(i*2)+1);
        sum = sum + Battery_values1[i];
    }
    sum = sum/12;
    
    for(i=0;i<=30;i=i+6)
    { 
          temp = ((((uint32_t)((ADC_values1[i/3]<<16) | (ADC_values1[(i/3)+1]<<4)))) & test);
          buff[(i/2)+1] = (uint8_t)(temp >> 20);
          buff[(i/2)+2] = (uint8_t)(temp >> 12);
          buff[(i/2)+3] = (uint8_t)(temp >> 4);
    }
    buff[19] = 0x00;
    
    //Get 12 samples after 12  ms into ecg_temp array which will be stored 
    //in 24 bit ecg array that can access from algorithm
    for(i=0;i<12;i++)
    {
       ecg_temp[i] = (uint16_t)ADC_values1[i];
    }
    if(sx==1)                           //sx variable is used to indicate start requirements for the algorithm
    {
        memcpy(&ecg[0],&ecg_temp[0],48);       //get first 12 samples into ecg array from 0 to 11
        //dsp();                                  //call dsp function which sets data_ready flag if DSP processing is done
        sx++;
    }
    else if(sx==2)
    {
        memcpy(&ecg[12],&ecg_temp[0],48);
        //dsp();
        sx++;
    }
    else
    {
        memcpy(&ecg[0],&ecg[12],48);
        memcpy(&ecg[12],&ecg_temp[0],48);
        //dsp();
    }
      

    if (sum < 1365)             //1365 for 1.75volt minimum for 3.5 volt
        sum = 1365;             //1738 for 2.1 volt maximum for 4.2 volt        
    if (sum> 1738)
        sum = 1738;

    sum = 373-(1738-sum);       // 373 = 1738 - 1365		
    battery_level = ((sum*100)/373);
    
    if(buff[0]==0)
    {}
    send_to_app(buff);
}

void packet_form(nrf_drv_saadc_evt_t const * p_event)
{
    uint32_t test = 0x0FFFFFF0,temp=0;
    uint16_t i=0;
    int16_t sum = 0;
    //memset(&buff[0],0,sizeof(buff));
		
    data_buffer = p_event->data.done.p_buffer;
    for (i=0;i<12;i++)
    {
        ADC_values[i] =*(data_buffer+i*2);
        Battery_values[i] = *(data_buffer+(i*2)+1);
        sum = sum + Battery_values[i];
    }
    
