minhnhatndc/minhatndc.github.io/modified_SDcard_NRF52.c
    for(i=0;i<=30;i=i+6)
    { 
          temp = ((((uint32_t)((ADC_values[i/3]<<16) | (ADC_values[(i/3)+1]<<4)))) & test);
          buff[(i/2)+1] = (uint8_t)(temp >> 20);
          buff[(i/2)+2] = (uint8_t)(temp >> 12);
          buff[(i/2)+3] = (uint8_t)(temp >> 4);
    }
//Lead of detection for Left ARM only 
    buff[19] = 0x00;
    
    sum = sum/12;
    if (sum < 1365)              //1365 for 1.65volt minimum for 3.5 volt
    {
        sum = 1365;             //1738 for 2.1 volt maximum for 4.2 volt
        sum = 373-(1738-sum);		// 373 = 1738 - 1365
        battery_level = ((sum*100)/373);
    }
    else if (sum> 1738)
    {
        sum = 1738;
        sum = 373-(1738-sum);		// 373 = 1738 - 1365
        battery_level = ((sum*100)/373);
    }
    else
    {
        sum = 373-(1738-sum);		// 373 = 1738 - 1365
        battery_level = ((sum*100)/373);
    }
//        if(buff[0]==0)
//    {}
    
    send_to_app(buff);

}
void saadc_callback(nrf_drv_saadc_evt_t const * p_event)
{
    if (p_event->type == NRF_DRV_SAADC_EVT_DONE)
    {
        ret_code_t err_code;

        err_code = nrf_drv_saadc_buffer_convert(p_event->data.done.p_buffer, SAMPLES_IN_BUFFER);
        APP_ERROR_CHECK(err_code);
        
//         int i;
//        printf("ADC event number: %d\r\n", (int)m_adc_evt_counter);
//
//        for (i = 0; i < SAMPLES_IN_BUFFER; i++)
//        {
//            printf("%d\r\n", p_event->data.done.p_buffer[i]);
//        }
//        m_adc_evt_counter++;
        
        
        if(mode_2_flag!=true)
        {
            packet_form(p_event);
        }
        if (mode_2_flag==true)
            mode2_function(p_event);   
    }
}

void saadc_init(void)
{
    ret_code_t err_code;
	
    //###########################################ANI0
    nrf_saadc_channel_config_t channel_0_config;
        channel_0_config.resistor_p = NRF_SAADC_RESISTOR_DISABLED;
        channel_0_config.resistor_n = NRF_SAADC_RESISTOR_DISABLED;
        channel_0_config.gain       = NRF_SAADC_GAIN1_6;
        channel_0_config.reference  = NRF_SAADC_REFERENCE_VDD4;
        channel_0_config.acq_time   = NRF_SAADC_ACQTIME_10US;
        channel_0_config.mode       = NRF_SAADC_MODE_SINGLE_ENDED;
        channel_0_config.pin_p      = NRF_SAADC_INPUT_AIN0;
        channel_0_config.pin_n      = NRF_SAADC_INPUT_DISABLED;

  //#############################################AIN1 
        nrf_saadc_channel_config_t channel_1_config;
        channel_1_config.resistor_p = NRF_SAADC_RESISTOR_DISABLED;
        channel_1_config.resistor_n = NRF_SAADC_RESISTOR_DISABLED;
        channel_1_config.gain       = NRF_SAADC_GAIN1_6;
        channel_1_config.reference  = NRF_SAADC_REFERENCE_VDD4;
        channel_1_config.acq_time   = NRF_SAADC_ACQTIME_10US;
        channel_1_config.mode       = NRF_SAADC_MODE_SINGLE_ENDED;
        channel_1_config.pin_p      = NRF_SAADC_INPUT_AIN2;          // AIN2/P0.04 
        channel_1_config.pin_n      = NRF_SAADC_INPUT_DISABLED;

    nrf_drv_saadc_config_t saadc_config;
		
    //Configure SAADC
    saadc_config.resolution = NRF_SAADC_RESOLUTION_12BIT;                                 //Set SAADC resolution to 12-bit. This will make the SAADC output values from 0 (when input voltage is 0V) to 2^12=2048 (when input voltage is 3.6V for channel gain setting of 1/6).
    saadc_config.oversample = NRF_SAADC_OVERSAMPLE_DISABLED;                              //Set oversample to 4x. This will make the SAADC output a single averaged value when the SAMPLE task is triggered 4 times.
    saadc_config.interrupt_priority = APP_IRQ_PRIORITY_LOW;                               //Set SAADC interrupt to low priority.
	
    err_code = nrf_drv_saadc_init(&saadc_config, saadc_callback);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_drv_saadc_channel_init(0, &channel_0_config);
    APP_ERROR_CHECK(err_code);
    err_code = nrf_drv_saadc_channel_init(1, &channel_1_config);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_drv_saadc_buffer_convert(m_buffer_pool[0],SAMPLES_IN_BUFFER);
    APP_ERROR_CHECK(err_code);
    
    err_code = nrf_drv_saadc_buffer_convert(m_buffer_pool[1],SAMPLES_IN_BUFFER);
    APP_ERROR_CHECK(err_code);
}

//===========================================SAADC END================================================================================
//===================================UART Start=================================================

//static void nus1_data_handler(ble_nus_t1 * p_nus1, uint8_t * p_data, uint16_t length)
//{
//    
//}

static void nus_data_handler(ble_nus_t * p_nus, uint8_t * p_data, uint16_t length)
{
    //printf("%x\r\n",p_data[0]);
    if (p_data[0] == 0x31 || p_data[0] == 0x01)
    {
        p_data[0] = 0x00;
        if(mode2_running==true)
        {
            mode2_running = false;
            saadc_sampling_event_uninit();
        }
        frequency = 20000;
        saadc_sampling_event_init();
        saadc_sampling_event_enable();
        mode1_running = true;
        mode_2_flag = false;
    }
    if (p_data[0] == 0x32|| p_data[0] == 0x02)
    {
        
        p_data[0] = 0x00;
        mode_2_flag = true;
        mode2_running = true;
        if(mode1_running==true)
        {
            mode1_running = false;
            saadc_sampling_event_uninit();
        }
        frequency = 10000;
        saadc_sampling_event_init();
        saadc_sampling_event_enable();
    }
        
}

void uart_event_handle(app_uart_evt_t * p_event)
{
    static uint8_t data_array[BLE_NUS_MAX_DATA_LEN];
    static uint8_t index = 0;
    uint32_t       err_code;

    switch (p_event->evt_type)
    {
        case APP_UART_DATA_READY:
            UNUSED_VARIABLE(app_uart_get(&data_array[index]));
            index++;

            if ((data_array[index - 1] == '\n') || (index >= (BLE_NUS_MAX_DATA_LEN)))
            {
                err_code = ble_nus_string_send(&m_nus, data_array, index);
                if (err_code != NRF_ERROR_INVALID_STATE)
                {
                    APP_ERROR_CHECK(err_code);
                }

                index = 0;
            }
            break;

        case APP_UART_COMMUNICATION_ERROR:
            APP_ERROR_HANDLER(p_event->data.error_communication);
            break;

        case APP_UART_FIFO_ERROR:
            APP_ERROR_HANDLER(p_event->data.error_code);
            break;

        default:
            break;
    }
}

static void uart_init(void)
{
    uint32_t                     err_code;
    const app_uart_comm_params_t comm_params =
    {
        RX_PIN_NUMBER,
        TX_PIN_NUMBER,
        RTS_PIN_NUMBER,
        CTS_PIN_NUMBER,
        APP_UART_FLOW_CONTROL_DISABLED,
        false,
        UART_BAUDRATE_BAUDRATE_Baud115200
    };

    APP_UART_FIFO_INIT( &comm_params,
                       UART_RX_BUF_SIZE,
                       UART_TX_BUF_SIZE,
                       uart_event_handle,
                       APP_IRQ_PRIORITY_LOWEST,
                       err_code);
    APP_ERROR_CHECK(err_code);
}
//===================================UART END==============================================================================================


/**@brief Callback function for asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num   Line number of the failing ASSERT call.
 * @param[in] file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}

/**@brief Function for starting advertising.
 */
void advertising_start(void)
{
    ret_code_t err_code;

    err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling File Data Storage events.
 *
 * @param[in] p_evt  Peer Manager event.
 * @param[in] cmd
 */
static void fds_evt_handler(fds_evt_t const * const p_evt)
{
    if (p_evt->id == FDS_EVT_GC)
    {
        //NRF_LOG_DEBUG("GC completed\n");
    }
}


